export const faqData = [
  {
    id: 1,
    question: 'Vue Чи React',
    answer:
      'Обидва фреймворки, Vue та React, мають свої переваги. Мені більше імпонує React через його більш читабельний синтаксис, особливо завдяки використанню JSX, що дозволяє органічно поєднувати HTML з JavaScript. React надає значну гнучкість у побудові інтерфейсів та має велику спільноту, що забезпечує доступ до численних бібліотек та інструментів.\n' +
      '\n' +
      'Vue, з іншого боку, відомий своєю простотою у навчанні та зручністю у використанні. Він також забезпечує потужний інструментарій для управління станом додатків та компонентами, а його гнучкість дозволяє легко інтегруватися у вже існуючі проекти. Vue може бути більш інтуїтивним для новачків завдяки своєму структурованому підходу до розробки.',
  },
  {
    id: 2,
    question: 'Як я суміщаю роботу та менторство',
    answer:
      'Суміщення роботи та менторства не займає багато часу і залежить від обставин та поточного навантаження. Зазвичай це від 1 до 4 годин на тиждень, які я присвячую код-рев’ю та спрямуванню колег у вирішенні завдань. Вважаю, що ці зусилля важливі для підтримки професійного розвитку новачків.',
  },
  {
    id: 3,
    question: 'Проекти для портфоліо',
    answer:
      'Ідеальні проєкти для портфоліо – це ті, що мають реальний потенціал бути запущеними. Рекомендуємо задуматись про створення проєкту, який ви або ваші близькі дійсно використовуватимуть. Наприклад, проєкт для друзів чи родичів – чудовий варіант, адже він не лише демонструє ваші технічні навички, але й доводить, що ви здатні вирішувати реальні проблеми. Такий підхід додає вагомості вашому портфоліо, роблячи його більш привабливим для потенційних роботодавців або замовників.',
  },
  {
    id: 4,
    question:
      'Чи можу я запропонувати свій проєкт для розробки, і яка буде ціна?',
    answer:
      ' Якщо йдеться про проєкт, над яким працюватимуть студенти, ви можете додати свою ідею в розділі менторінгу. Вартість розробки такого проєкту буде безкоштовною, адже це чудова можливість для студентів отримати практичний досвід. Збирайте команду, працюйте над проєктом і запускайте його разом з ментором!',
  },
  {
    id: 5,
    question: 'Як довго триває навчання (розробка проекту)',
    answer:
      'Тривалість розробки проєкту залежить від кількох факторів: складу команди, досвіду розробників, часу, який студенти готові присвятити роботі, а також складності самого проєкту. Це може зайняти від кількох місяців до декількох років, залежно від цих умов.',
  },
  {
    id: 6,
    question: 'Яка ціна менторства?',
    answer:
      'Я витрачаю до 4 годин на тиждень на менторство для всіх проєктів, над якими працюю. Якщо вам потрібно більше уваги до конкретного проєкту або індивідуальний менторинг, це питання потрібно обговорювати окремо. Важливо розуміти ваші цілі, поточний стан проєкту та оцінити, скільки часу доведеться витратити, щоб досягти бажаних результатів. Також ви можете назначити на проект свого ментора, в майбутньому я додам можливість фінансової мотивації для нових менторів.',
  },
]
